<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest LunarG Vulkan SDK installer</string>
    <key>Identifier</key>
    <string>com.github.sandercox.download.vulkansdk</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>VulkanSDK</string>
        <key>VERSION_URL</key>
        <string>https://vulkan.lunarg.com/sdk/files.json</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%VERSION_URL%</string>
                <key>re_pattern</key>
                <string>&quot;mac&quot;:\s*.\s*&quot;([0-9]+\.[0-9]+\.[0-9]+\.[0-9]+)&quot;</string>
                <key>result_output_var_name</key>
                <string>VULKAN_VERSION</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://sdk.lunarg.com/sdk/download/%VULKAN_VERSION%/mac/vulkansdk-macos-%VULKAN_VERSION%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>